# notes:
# run `brew bundle cleanup` to see stuff installed that's not in this file
# run `brew bundle cleanup --force` to remove that stuff

tap "homebrew/bundle"
tap "homebrew/services"

# tools
brew "eza" # ls replacement
brew "fd" # find replacement
brew "fish" # shell
brew "fzf" # fuzzy finder
brew "gh" # github cli
brew "git-delta" # git diff viewer
brew "jo" # write json from the command line
brew "jq" # json selector
brew "just" # task runner
brew "ripgrep" # grep replacement
brew "sd" # sed replacement
brew "starship" # shell prompt PS1 thing
brew "stow" # symlink manager, for dotfiles
brew "yazi" # file browser
brew "pgcli" # auto-complete for psql
brew "schpet/tap/envset" # updates .env files

# programming
brew "deno" # imagine if node was fun
brew "fnm" # node version manager
brew "rbenv" # ruby version manager
brew "rubyfmt" # ruby formatter extraordinaire

# odds and ends
brew "cdrtools" # burn a cd from the cli
brew "switchaudio-osx" # lets you switch audio input/output from the command line

# basics
brew "coreutils" # real variants of sed, grep, etc
brew "curl" # use up-to-date curl
brew "ffmpeg" # convert my media
brew "git" # use up-to-date git
brew "libpq" # postgresql stuff?
brew "neovim" # vim replacement
brew "redis"
brew "sqlite" # a great database
brew "tmux" # not much of a reason to run this locally
brew "vips" # image processing library

# apis
brew "awscli" # script aws so i don't have to use their website
brew "flyctl" # fly.io cli
brew "heroku/brew/heroku" # heroku cli
brew "stripe/stripe-cli/stripe" # stripe cli

# gui apps
cask "ghostty" # terminal emulator
cask "alt-tab" # prefer this over mac os's command-tab (shows a vertical list with window titles)
cask "zed@preview" # text editor
cask "raycast" # spotlight replacement
cask "cog" # plays flac files
cask "docker" # container stuff
cask "rectangle" # window manager
